In [51]:
#If pandas not installed put following command
!pip install pandas

Requirement already satisfied: pandas in e:\anaconda\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in e:\anaconda\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in e:\anaconda\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in e:\anaconda\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in e:\anaconda\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in e:\anaconda\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [184]:
import pandas as pd

In [185]:
#Creating Series (1-Dimentional)
cars=pd.Series(["BMW" , "Toyoto" , "Honda"])

#Printing Series
cars

0       BMW
1    Toyoto
2     Honda
dtype: object

In [186]:
colours = pd.Series(["Red" , "Pink" , "Blue"])

#DataFrame = 2-Dimensional
#DataFrames use dictionary in python

car_data=pd.DataFrame({"Car make" : cars , "Colours" : colours})

print(car_data)

  Car make Colours
0      BMW     Red
1   Toyoto    Pink
2    Honda    Blue

In [126]:
# Create a dictionary with data
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [20, 21, 19, 22],
    "Marks": [85, 90, 78, 88]
}

# Convert dictionary to DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Age  Marks
0    Alice   20     85
1      Bob   21     90
2  Charlie   19     78
3    David   22     88

In [157]:
#Importing Dataset
# Syntax - name = pd.read_csv("Path")
#forward slash should be used in path instead of backward slash

df = pd.read_csv("D:/ML SIG/car-sales-extended.csv")

In [158]:
df

       Make Colour  Odometer (KM)  Doors    Price
0     Honda  White        35431.0      4  15323.0
1       BMW   Blue       192714.0      5  19943.0
2     Honda  White        84714.0      4  28343.0
3    Toyota  White       154365.0      4  13434.0
4    Nissan   Blue       181577.0      3  14043.0
..      ...    ...            ...    ...      ...
995  Toyota  Black        35820.0      4  32042.0
996  Nissan  White       155144.0      3   5716.0
997  Nissan   Blue        66604.0      4  31570.0
998   Honda  White       215883.0      4   4001.0
999   Honda  White       215883.0      4   4001.0

[1000 rows x 5 columns]

In [159]:
#prints 5 rows by default
df.head()

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0      4  15323.0
1     BMW   Blue       192714.0      5  19943.0
2   Honda  White        84714.0      4  28343.0
3  Toyota  White       154365.0      4  13434.0
4  Nissan   Blue       181577.0      3  14043.0

In [160]:
df.head(7) #to print fisrt 7 rows

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0      4  15323.0
1     BMW   Blue       192714.0      5  19943.0
2   Honda  White        84714.0      4  28343.0
3  Toyota  White       154365.0      4  13434.0
4  Nissan   Blue       181577.0      3  14043.0
5   Honda    NaN        42652.0      4  23883.0
6  Toyota   Blue       163453.0      4   8473.0

In [161]:
#Prints last 5 rows
df.tail()

       Make Colour  Odometer (KM)  Doors    Price
995  Toyota  Black        35820.0      4  32042.0
996  Nissan  White       155144.0      3   5716.0
997  Nissan   Blue        66604.0      4  31570.0
998   Honda  White       215883.0      4   4001.0
999   Honda  White       215883.0      4   4001.0

In [162]:
#prints last n rows
df.tail(7)

       Make Colour  Odometer (KM)  Doors    Price
993  Nissan  Black       162523.0      4   4696.0
994     BMW   Blue       163322.0      3  31666.0
995  Toyota  Black        35820.0      4  32042.0
996  Nissan  White       155144.0      3   5716.0
997  Nissan   Blue        66604.0      4  31570.0
998   Honda  White       215883.0      4   4001.0
999   Honda  White       215883.0      4   4001.0

In [163]:
#To see all column names of a dataframe
df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [164]:
#To check datatypes of each columns
df.dtypes

Make              object
Colour            object
Odometer (KM)    float64
Doors              int64
Price            float64
dtype: object

In [165]:
df.isnull().sum()

Make             0
Colour           2
Odometer (KM)    3
Doors            0
Price            2
dtype: int64

In [166]:
# to get summary statistics of numerical data
df.describe()

       Odometer (KM)        Doors         Price
count     997.000000  1000.000000    998.000000
mean   130790.733200     4.014000  16035.903808
std     68927.062686     0.379405   8631.266380
min     10148.000000     3.000000   2796.000000
25%     70154.000000     4.000000   9460.500000
50%    130783.000000     4.000000  14264.000000
75%    192250.000000     4.000000  20689.250000
max    249860.000000     5.000000  52458.000000

In [167]:
# select a single column
df["Doors"]

0      4
1      5
2      4
3      4
4      3
      ..
995    4
996    3
997    4
998    4
999    4
Name: Doors, Length: 1000, dtype: int64

In [168]:
df[["Doors", "Price"]]

     Doors    Price
0        4  15323.0
1        5  19943.0
2        4  28343.0
3        4  13434.0
4        3  14043.0
..     ...      ...
995      4  32042.0
996      3   5716.0
997      4  31570.0
998      4   4001.0
999      4   4001.0

[1000 rows x 2 columns]

In [169]:
#selecting rows
df[7:15]

      Make Colour  Odometer (KM)  Doors    Price
7    Honda  White        43120.0      4  20306.0
8   Nissan  White       130538.0      4   9374.0
9    Honda   Blue        51029.0      4  26683.0
10  Nissan  White       167421.0      4  16259.0
11  Nissan  Green        17119.0      4   6160.0
12  Nissan  White       102303.0      4  16909.0
13  Nissan  White            NaN      4  11121.0
14   Honda   Blue            NaN      4  18946.0

### Using loc and iloc

In [170]:
animals = pd.Series (["cat" , "Dog" , "bird" , "Panda" , "snake" ] , index = [0,3,9,8,3])
animals

0      cat
3      Dog
9     bird
8    Panda
3    snake
dtype: object

In [171]:
animals.loc[3]

3      Dog
3    snake
dtype: object

In [172]:
#iloc -> refers to the position of the object
animals.iloc[3]

'Panda'

In [173]:
animals.iloc[:3]

0     cat
3     Dog
9    bird
dtype: object

In [174]:
#For this type of slicing we need to specify starting index , ending index and steps
#It does not consider the last index
animals.iloc[-1:-4:-1]

3    snake
8    Panda
9     bird
dtype: object

In [175]:
#accessing row of dataset using loc
df.loc[999]

Make                Honda
Colour              White
Odometer (KM)    215883.0
Doors                   4
Price              4001.0
Name: 999, dtype: object

In [176]:
#accessing row using iloc
df.iloc[-1]

Make                Honda
Colour              White
Odometer (KM)    215883.0
Doors                   4
Price              4001.0
Name: 999, dtype: object

Note: difference between iloc and loc
With iloc, we can pass -1 to get the last row --- something we could not do with loc.

That is in previous code if you write print(df.loc[-1]), it will show error. Try and understand difference between label vs index.

### prblm -code will not change the values in the odometer column 
### soln -  1]Put inplace = true
###        2] assign the value to the column

In [177]:
df["Odometer (KM)"].fillna(df["Odometer (KM)"].mean())

0       35431.0
1      192714.0
2       84714.0
3      154365.0
4      181577.0
         ...
995     35820.0
996    155144.0
997     66604.0
998    215883.0
999    215883.0
Name: Odometer (KM), Length: 1000, dtype: float64

In [178]:
df.isnull().sum()

Make             0
Colour           2
Odometer (KM)    3
Doors            0
Price            2
dtype: int64

In [149]:
#df.dropna(inplace=True)

In [180]:
df.duplicated().sum()

1

In [ ]:
#df.drop_duplicates(inplace=True)

In [179]:
df.dtypes["Price"]

dtype('float64')

In [95]:
df["Price"] = df["Price"].astype(str)
df.dtypes["Price"]

dtype('O')

Here, 'O' stands for "Object", which means the column is now stored as a string.

In [89]:
#Filtering the data using conditional operator
df[df["Odometer (KM)"] >100000]

       Make Colour  Odometer (KM)  Doors    Price
1       BMW   Blue       192714.0      5  19943.0
3    Toyota  White       154365.0      4  13434.0
4    Nissan   Blue       181577.0      3  14043.0
6    Toyota   Blue       163453.0      4   8473.0
8    Nissan  White       130538.0      4   9374.0
..      ...    ...            ...    ...      ...
993  Nissan  Black       162523.0      4   4696.0
994     BMW   Blue       163322.0      3  31666.0
996  Nissan  White       155144.0      3   5716.0
998   Honda  White       215883.0      4   4001.0
999  Toyota   Blue       248360.0      4  12732.0

[623 rows x 5 columns]

In [181]:
#Filtering data using logical operator
df[(df["Odometer (KM)"] > 100000) & (df["Doors"] == 4)]

       Make Colour  Odometer (KM)  Doors    Price
3    Toyota  White       154365.0      4  13434.0
6    Toyota   Blue       163453.0      4   8473.0
8    Nissan  White       130538.0      4   9374.0
10   Nissan  White       167421.0      4  16259.0
12   Nissan  White       102303.0      4  16909.0
..      ...    ...            ...    ...      ...
990  Toyota  White       173408.0      4   8082.0
991   Honda   Blue       235985.0      4   9184.0
993  Nissan  Black       162523.0      4   4696.0
998   Honda  White       215883.0      4   4001.0
999   Honda  White       215883.0      4   4001.0

[530 rows x 5 columns]

In [97]:
#Applying function to Data
df["Doors"].head()

0    4
1    5
2    4
3    4
4    3
Name: Doors, dtype: int64

In [99]:
df["Doors"] = df["Doors"].apply(lambda x: x+1)
df["Doors"].head()

0    5
1    6
2    5
3    5
4    4
Name: Doors, dtype: int64

In [187]:
#sorting in ascending order
df.sort_values("Doors")

       Make Colour  Odometer (KM)  Doors    Price
720     BMW  White        57905.0      3  50868.0
405     BMW   Blue       142189.0      3  23336.0
181  Nissan  White       118470.0      3  20075.0
108  Nissan   Blue       129769.0      3  15617.0
307  Nissan   Blue       174825.0      3   4863.0
..      ...    ...            ...    ...      ...
779     BMW   Blue       212644.0      5  19545.0
214     BMW  Green       206446.0      5  19892.0
215     BMW  White        75042.0      5  38128.0
844     BMW  Green       112156.0      5  12904.0
238     BMW  White       194157.0      5  34856.0

[1000 rows x 5 columns]

In [188]:
#sorting in descending order
df.sort_values("Doors", ascending = False)

       Make Colour  Odometer (KM)  Doors    Price
277     BMW   Blue       245427.0      5  17520.0
837     BMW    Red       149413.0      5  36864.0
793     BMW   Blue       179255.0      5  33040.0
902     BMW  White        84327.0      5  38233.0
674     BMW  White       235774.0      5  29401.0
..      ...    ...            ...    ...      ...
859  Nissan   Blue       191024.0      3   9450.0
146     BMW  White       148949.0      3  23074.0
369  Nissan  White       133069.0      3   5008.0
633  Nissan  White       205155.0      3  10287.0
751  Nissan   Blue       195105.0      3   7823.0

[1000 rows x 5 columns]

## Thank You !!